In [1]:
!pip install -q -U watermark

[notice] A new release of pip is available: 23.3.1 -> 24.0
[notice] To update, run: pip install --upgrade pip

In [2]:
import joblib
import pandas as pd
import numpy as np
from sklearn import linear_model
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
import warnings
warnings.filterwarnings("ignore")

In [3]:
%reload_ext watermark
%watermark -a "Juliana Santimaria"

Author: Juliana Santimaria

In [4]:
dados = pd.read_csv('dataset.csv')

In [5]:
dados.shape

(13, 4)

In [6]:
dados

             Modelo  Kilometragem  Preco_Venda  Idade_Veiculo
0   Volkswagen Polo         79000        18000              6
1   Volkswagen Polo         65000        34000              3
2   Volkswagen Polo         57000        26100              5
3   Volkswagen Polo         72500        40000              2
4   Volkswagen Polo         44000        31500              4
5    Chevrolet Onix         69000        29400              5
6    Chevrolet Onix         62000        32000              5
7    Chevrolet Onix         61000        19300              6
8    Chevrolet Onix         71000        12000              8
9      Hyundai HB20         64000        22000              6
10     Hyundai HB20         81000        20000              7
11     Hyundai HB20         73000        21000              7
12     Hyundai HB20         57000        33000              5

In [7]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Modelo         13 non-null     object
 1   Kilometragem   13 non-null     int64
 2   Preco_Venda    13 non-null     int64
 3   Idade_Veiculo  13 non-null     int64
dtypes: int64(3), object(1)
memory usage: 544.0+ bytes

In [8]:
dados

             Modelo  Kilometragem  Preco_Venda  Idade_Veiculo
0   Volkswagen Polo         79000        18000              6
1   Volkswagen Polo         65000        34000              3
2   Volkswagen Polo         57000        26100              5
3   Volkswagen Polo         72500        40000              2
4   Volkswagen Polo         44000        31500              4
5    Chevrolet Onix         69000        29400              5
6    Chevrolet Onix         62000        32000              5
7    Chevrolet Onix         61000        19300              6
8    Chevrolet Onix         71000        12000              8
9      Hyundai HB20         64000        22000              6
10     Hyundai HB20         81000        20000              7
11     Hyundai HB20         73000        21000              7
12     Hyundai HB20         57000        33000              5

In [9]:
df_dummies = pd.get_dummies(dados['Modelo'])

In [10]:
df_dummies

    Chevrolet Onix  Hyundai HB20  Volkswagen Polo
0                0             0                1
1                0             0                1
2                0             0                1
3                0             0                1
4                0             0                1
5                1             0                0
6                1             0                0
7                1             0                0
8                1             0                0
9                0             1                0
10               0             1                0
11               0             1                0
12               0             1                0

In [11]:
df = pd.concat([dados, df_dummies], axis = 'columns')

In [12]:
df

,Modelo,Kilometragem,Preco_Venda,Idade_Veiculo,Chevrolet Onix,Hyundai HB20,Volkswagen Polo
0,Volkswagen Polo,79000,18000,6,0,0,1
1,Volkswagen Polo,65000,34000,3,0,0,1
2,Volkswagen Polo,57000,26100,5,0,0,1
3,Volkswagen Polo,72500,40000,2,0,0,1
4,Volkswagen Polo,44000,31500,4,0,0,1
5,Chevrolet Onix,69000,29400,5,1,0,0
6,Chevrolet Onix,62000,32000,5,1,0,0
7,Chevrolet Onix,61000,19300,6,1,0,0
8,Chevrolet Onix,71000,12000,8,1,0,0
9,Hyundai HB20,64000,22000,6,0,1,0
10,Hyundai HB20,81000,20000,7,0,1,0
11,Hyundai HB20,73000,21000,7,0,1,0
12,Hyundai HB20,57000,33000,5,0,1,0

In [13]:
newdf = df.drop(['Modelo'], axis = 1)

In [14]:
newdf

,Kilometragem,Preco_Venda,Idade_Veiculo,Chevrolet Onix,Hyundai HB20,Volkswagen Polo
0,79000,18000,6,0,0,1
1,65000,34000,3,0,0,1
2,57000,26100,5,0,0,1
3,72500,40000,2,0,0,1
4,44000,31500,4,0,0,1
5,69000,29400,5,1,0,0
6,62000,32000,5,1,0,0
7,61000,19300,6,1,0,0
8,71000,12000,8,1,0,0
9,64000,22000,6,0,1,0
10,81000,20000,7,0,1,0
11,73000,21000,7,0,1,0
12,57000,33000,5,0,1,0

In [15]:
x = newdf.drop('Preco_Venda', axis = 1)

In [16]:
x

    Kilometragem  Idade_Veiculo  Chevrolet Onix  Hyundai HB20  Volkswagen Polo
0          79000              6               0             0                1
1          65000              3               0             0                1
2          57000              5               0             0                1
3          72500              2               0             0                1
4          44000              4               0             0                1
5          69000              5               1             0                0
6          62000              5               1             0                0
7          61000              6               1             0                0
8          71000              8               1             0                0
9          64000              6               0             1                0
10         81000              7               0             1                0
11         73000              7               0             1                0
12         57000              5               0             1                0

In [17]:
y = newdf['Preco_Venda']

In [18]:
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Preco_Venda, dtype: int64

In [20]:
modelo_mod_v1 = linear_model.LinearRegression()

In [21]:
modelo_mod_v1.fit(x,y)

LinearRegression()

In [22]:
modelo_mod_v1.predict(x)

array([18105.0215775 , 35327.25262423, 24783.14553092, 40410.02746228,
       30974.55280508, 28487.61326992, 28866.17068713, 23431.87824739,
       11914.33779555, 25628.97126508, 19221.24546681, 19653.88251505,
       31495.90075306])

In [23]:
modelo_mod_v1.predict([[7000,4,0,0,1]])

array([32975.49915317])

In [24]:
modelo_mod_v1.predict([[45000,4,0,1,0]])

array([37633.22839618])

In [25]:
modelo_mod_v1.predict([[86000,7,1,0,0]])

array([16591.51540088])

In [26]:
modelo_mod_v1.score(x,y)

0.9355612290620992

In [27]:
df_car = dados

In [28]:
df_car

             Modelo  Kilometragem  Preco_Venda  Idade_Veiculo
0   Volkswagen Polo         79000        18000              6
1   Volkswagen Polo         65000        34000              3
2   Volkswagen Polo         57000        26100              5
3   Volkswagen Polo         72500        40000              2
4   Volkswagen Polo         44000        31500              4
5    Chevrolet Onix         69000        29400              5
6    Chevrolet Onix         62000        32000              5
7    Chevrolet Onix         61000        19300              6
8    Chevrolet Onix         71000        12000              8
9      Hyundai HB20         64000        22000              6
10     Hyundai HB20         81000        20000              7
11     Hyundai HB20         73000        21000              7
12     Hyundai HB20         57000        33000              5

In [29]:
le = LabelEncoder()

In [30]:
df_car['Modelo'] = le.fit_transform(df_car['Modelo'])

In [31]:
df_car

    Modelo  Kilometragem  Preco_Venda  Idade_Veiculo
0        2         79000        18000              6
1        2         65000        34000              3
2        2         57000        26100              5
3        2         72500        40000              2
4        2         44000        31500              4
5        0         69000        29400              5
6        0         62000        32000              5
7        0         61000        19300              6
8        0         71000        12000              8
9        1         64000        22000              6
10       1         81000        20000              7
11       1         73000        21000              7
12       1         57000        33000              5

In [32]:
x = df_car[['Modelo', 'Kilometragem', 'Idade_Veiculo']].values

In [33]:
x

array([[    2, 79000,     6],
       [    2, 65000,     3],
       [    2, 57000,     5],
       [    2, 72500,     2],
       [    2, 44000,     4],
       [    0, 69000,     5],
       [    0, 62000,     5],
       [    0, 61000,     6],
       [    0, 71000,     8],
       [    1, 64000,     6],
       [    1, 81000,     7],
       [    1, 73000,     7],
       [    1, 57000,     5]])

In [34]:
y = df_car['Preco_Venda']

In [35]:
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Preco_Venda, dtype: int64

In [38]:
modelo_mod_v2 = linear_model.LinearRegression()

In [39]:
modelo_mod_v2.fit(x,y)

LinearRegression()

In [40]:
modelo_mod_v2.predict(x)

array([20594.96255322, 35709.41910683, 26372.80065489, 40228.36867645,
       31766.57106881, 29143.34538167, 29442.06469435, 24645.7329058 ,
       14540.97907838, 22876.39285467, 17311.92569064, 17653.31919085,
       28014.11814344])

In [41]:
modelo_mod_v2.predict([[1,12500,2]])

array([44430.13741661])

In [42]:
modelo_mod_v2.score(x,y)

0.8757010116903793

In [43]:
df_car = dados

In [44]:
df_car

    Modelo  Kilometragem  Preco_Venda  Idade_Veiculo
0        2         79000        18000              6
1        2         65000        34000              3
2        2         57000        26100              5
3        2         72500        40000              2
4        2         44000        31500              4
5        0         69000        29400              5
6        0         62000        32000              5
7        0         61000        19300              6
8        0         71000        12000              8
9        1         64000        22000              6
10       1         81000        20000              7
11       1         73000        21000              7
12       1         57000        33000              5

In [45]:
OHEncoder = ColumnTransformer([('Modelo', OneHotEncoder(), [0])], remainder = 'passthrough')

In [46]:
x = df_car.drop('Preco_Venda', axis = 1)

In [47]:
x

    Modelo  Kilometragem  Idade_Veiculo
0        2         79000              6
1        2         65000              3
2        2         57000              5
3        2         72500              2
4        2         44000              4
5        0         69000              5
6        0         62000              5
7        0         61000              6
8        0         71000              8
9        1         64000              6
10       1         81000              7
11       1         73000              7
12       1         57000              5

In [48]:
y = df_car['Preco_Venda']

In [49]:
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Preco_Venda, dtype: int64

In [50]:
X = OHEncoder.fit_transform(x)

In [51]:
X

array([[0.00e+00, 0.00e+00, 1.00e+00, 7.90e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 6.50e+04, 3.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 5.70e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 7.25e+04, 2.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 4.40e+04, 4.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 6.90e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 6.20e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 6.10e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 7.10e+04, 8.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 6.40e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 8.10e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 7.30e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00]])

In [52]:
modelo_mod_v3 = linear_model.LinearRegression()

In [53]:
modelo_mod_v3.fit(X,y)

LinearRegression()

In [54]:
modelo_mod_v3.predict([[0.00e+00,0.00e+00,1.00e+00,7.90e+04,6.00e+00]])

array([18105.0215775])

In [55]:
modelo_mod_v3.predict([[0.00e+00,1.00e+00,0.00e+00,5.70e+04,8.00e+00]])

array([15030.78454075])

In [56]:
modelo_mod_v3.score(X,y)

0.935561229062099

In [57]:
acc_v1 = 0.9355612290620993

In [58]:
acc_v3 = 0.935561229062099

In [59]:
acc_v1 > acc_v3

True

In [60]:
joblib.dump(modelo_mod_v3, 'modelo_mod_treinado.pkl')

['modelo_mod_treinado.pkl']

In [61]:
%watermark -a "Juliana Santimaria"

Author: Juliana Santimaria

In [62]:
#%watermark -v -m

In [63]:
#%watermark --iversions